Repository: Abdelrahman-Abdelbaky/algoriza-internship-2023BE134
Catalog: VezeetaProject.Core/Resources/SharedResources.*.resx
Languages: ar

# AddFailed
source: Added Failed
ar: فشل عملية الاضافة

# AddSuccessfully
source: Added successfully
ar: تم الاضافة بنجاح

# Appointment
source: the appointment on {0} at {1} and {2} minutes
ar: يوم {0} الساعة {1} و {2} دقيقة

source: Booking Failed
ar: فشل عملية الحجز

source: Booking Successfully
ar: تم عملية الحجز بنجاح

# DayErrorInput
source: The day you entered is out of the range of 0 to 6
ar: اليوم الذي أدخلته يقع خارج النطاق من 0 إلى 6

# DayNotFound
source: {0} is not found in the appointments
ar: لم يتم ايجاد يوم {0} في المواعيد

source: Deactivated
ar: تم الغاء التفعيل

source: Delete Failed
ar: فشل عملية الحذف

source: Delete Suceesfully
ar: تم الخذف بنجاح

# DiscountCode
source: Discount code name is used
ar: يوجد كود خصم بنفس الاسم

# DiscountCodeNotFound
source: The discount code not found or deactivated
ar: كود الخصم غير موجود او تم الغاء تفعيلة

# DiscountError
source: Sory! The dicount code is used or id is wrong
ar: كود الخصم مستخدم من قبل

# DoctorBookingError
source: you can not book with this doctor because you have a request pending with him
ar: لا يمكنك الحجز مع هذا الطبيب لأن لديك طلباً معلقاً معه

# doctorHasBookings
source: doctor have bookings
ar: الطبيب لديه حجوزات

# EmailNotFound
source: The mail is used before
ar: البريد الالكتروني مستخدم من قبل

# EmailUsed
source: The email used before
ar: البريد الالكتروني مستخدم من قبل

# ImageTypeError
source: We are take imge only from this type [PNG,JPEG,JPG]
ar: لايمكن استقبال غير صور من النوع التالي [JPG,PNG,JPEG]

# Language
source: English
ar: العرابية

source: Not Found
ar: هذا العنصر غير متوفر

# numberOfPagenotLessThan1
source: Number of page can not less than 1
ar: لايمكن ان يكون رقم الصفحة اقل من 1

# PasswordOrEmailIncorrect
source: The password or email is incorrect
ar: البريد الالكتروني او الرقم السري غير صحيح

# PriceUpdateError
source: we can not update the price because it added before
ar: لا يمكن تعديل السعر الانه تم اضافة من قبل

# RequestConditionError
source: you are not complete { 0 } requests to can use discount
ar: انت لم تكمل {0} حجوزات كاملة حتي تتمكن من الاستفاده من الاخصم

source: Size of page can not less than 1
ar: حجم الصفحة لايمكن ان يكون اقل من 1

source: specialize Id Is Wrong
ar: رقم التخصص غير موجود

source: the Id must be not Less than 1
ar: لا يمكن ان يكون رقم التعريف اقل من 1

source: the value can not be Equal or less than zero
ar: لايمكن ان تكون القيمة اصغر من او تساوي صفر

source: The value cannot be greater than 100% !
ar: لا يمكن ان تكون النسبة اكبر من 100

source: The value cannot be Less than 0 !
ar: لا يمكن ان التكون القيمة اقل من صفر

# TimeDayNotFound
source: the appointment on {0} at {1} and {2} minutes not Found
ar: لم يتم ايجاد موعد يوم {0} الساعة {1} و {2} دقيقة

# TimeError
source: the appointment on {0} at {1} and {2} minutes was not added because it was added before
ar: لم يتم اضافة موعد يوم {0} الساعة {1} و {2} دقيقة لانه موجود مسبقا

# TimeIsUsed
source: We cannot make an update on appointment because it was used by another patient
ar: لا يمكن تعديل الموعد لانه مستخدم من قبل احد المرضي

source: Update Failed
ar: فشل عملية التعديل

# UpdateSuccessfully
source: Modified successfully
ar: تم التعديل بنجاح

source: Welcome
ar: مرحبا
